// import { } from "../assets/images/png/1"
import {img11, img12, img14, img15, img16, img17, img110, img112, img113, img115, img116, img362, img363, img364, img366, img368, img369, img371, img376, img377, img379 } from "../assets/images/png"


export const bilet = {
    bilet01:[
        {
            id: 0,
            img: img11,
            question: " Бу белгиларнинг таъсир оралиғида қайси автомобил учун тўхташга рухсат берилади?",
            answer: ["Қизилга", "Иккала автомобилга", "Ҳеч қайси бирига","Capиқ автомобилга"],
            right: 3,
        },
        {
            id: 1,
            img: img12,
            question: "Йўналтиргичларнинг қайсилари бўйлаб ҳаракатланишга рухсат этилади?",
            answer: ["Фақат А йўналиш бўйлаб", "Фақат Б йўналиш бўйлаб","Фақат В йўналиш бўйлаб","Фақат А ва Г йўналишлари бўйлаб","Фақат Г йўналиш бўйлаб"],
            right: 3,
        },
        {
            id: 2,
            img: null,
            question: "Тиббиёт қутичаси ва ўт ўчиргич бўлмаган қандай траснпорт воситаларидан фойнадаланиш тақиқланади?",
            answer: ["Фақат M1 тоифали траснпорт воситаcи", " Фақат M2; M3; N1 тоифали траснпорт воситаcи","Фақат N2; N3 тоифали траснпорт воситаcи","Ҳамма санаб ўтилган транспорт воситаларидан"],
            right: 3

        },
        {
            id: 3,
            img: img14,
            question: "Чорраҳадан биринчи бўлиб ўтади:",
            answer: ["Қизил автомобил", "Кўк автомобил", "Сариқ автомобил",,"Яшил автомобил"],
            right: 3
        },
        {
            id: 4,
            img: img15,
            question: "Ҳаракатланиш таъқиқланади:",
            answer: ["Қизил ва оқ автомобилларга", "Кўк, яшил ва оқ автомобилларга", "Оқ, кўк ва сариқ автомобилларга",],
            right: 1
        },
        {
            id: 5,
            img: img16,
            question: "Қайси транспорт воситасининг ҳайдовчиси чорраҳадан биринчи бўлиб ўтади?",
            answer: ["Автомобил ва автобус ҳайдовчиси", "Трамвай ҳайдовчиси",],
            right: 0
        }, {
            id: 6,
            img:img17,
            question: "Шу жойда тўхтаб туришга рухсат этиладими?",
            answer: ["Рухсат этилади", "Таъқиқланади"],
            right: 0
        },
        {
            id: 7,
            img: null,
            question: "Ҳайдовчи ҳаракатланишни бошлашидан олдин қандай амалларни бажариши керак?",
            answer: ["Транспорт воситасининг созлигини ва тўла жихозланганлигини текшириши", "Ҳаракатланиш бошланиши ҳавфсиз бўлишига ва ҳаракатнинг бошқа иштирокчиларига ҳалақит бермаслигига ишонч ҳосил қилиши керак", "Тегишли йўналишдаги бурилишнинг ёруғлик кўрсаткичи билан ишора бериши", "Санаб ўтилган ҳамма ҳаракатларни бажариши",],
            right: 1
        },
        {
            id: 8,
            img: null,
            question: "Умуртқасининг кўкрак қисми шикастланган киши транспортда қандай ташилади?",
            javob1: "",
            answer: ["Қаттиқ тахтада орқаси билан ётган ҳолда", "Юмшоқ тушамада орқаси билан ётган ҳолда", "Қаттиқ тахтада ёни билан ётган ҳолда"],
            right: 0
        },
        {
            id: 9,
            img: img110,
            question: "Бундай таниқлик белгиси билан белгиланадиган транспорт воситаси:",
            answer: ["Оғир вазнли ва йирик ўлчамли юкларни ташувчи", "Узунлиги юк билан ёки юксиз 20 метрдан ортиқ бўлган транспорт воситаси", "Фургон юкхонасида одамларни ташувчи"],
            right: 1
        },
        {
            id: 10,
            img: null,
            question: "Сарғиш рангли милтилловчи чироқ ёқилган ҳолатда ҳаракатланиш учун имтиёз берадими?",
            answer: ["Ҳа", "Йўқ"],
            right: 1
        },
        {
            id: 11,
            img: img112,
            question: "Қўйидаги белгилар қайси йўналишда ҳаракатланишга рухсат беради?",
            answer: ["Фақат чапга", "Фақат тўғрига", "Фақат ўнгга","Тўғрига, ўнгга ва қайрилишга"],
            right: 3
        },
        {
            id: 12,
            img: img113,
            question: "Мазкур чизиқ нима ҳақида огоҳлантиради?",
            answer: [" Транспорт воситаларининг мажбурий тўхташ жойига яқинлашаётгани", " «Тўхтамасдан ҳаракатланиш тақиқланган» белгиси билан бирга қўлланилганда ҳайдовчини «Тўхташ» чизиғига яқинлашаётганлигини", "Транспорт воситаси пиёдаларга йўл бериши керак бўлган жойни кўрсатади"],
            right: 1
        },
        {
            id: 13,
            img: null,
            question: "Автомагистралда қуйидагилар таъқиқланади:",
            answer: ["Қайрилиб олиш ва ажратувчи бўлакнинг технологик ўзилиш жойларига кириш", "Орқага ҳаракатланиш", " «Тўхтаб туриш жойи» ёки «Дам олиш жойи» белгилари бўлган махсус майдончалардан ташқари жойда тўхташ","Юқоридаги барча ҳолатлар"],
            right: 3
        },
        {
            id: 14,
            img: img115,
            question: "Қайси транспорт воситаси ҳайдовчиси тўғрига ҳаракатланиш ҳуқуқига эга?",
            answer: [" Автобус ва мотоцикл ҳайдовчилари", "Енгил ва юк автомобиллари ҳайдовчилари", "Енгил автомобил ҳайдовчиси"],
            right: 2
        },
        {
            id: 15,
            img: img116,
            question: "Қайси транспорт воситасининг ҳайдовчиси йўл бериши керак?",
            answer: ["Автомобил ҳайдовчиси", "Трамвай ҳайдовчиси"],
            right: 1
        },
        {
            id: 16,
            img: null,
            question: "Транспорт воситасини орқага ҳаракатлантириш пайтида ҳайдовчи қандай талабларни бажариши керак?",
            answer: ["Ҳаракатнинг бошқа иштирокчиларига ҳалақит бермаслик. Ҳаракат ҳавфсизлигини таъминлаш учун зарур бўлса, бошқа шахслар ёрдамидан фойдаланиш", "Бошқа шахслар ёрдамидан фойдаланиш", "Транспорт воситасида туманга қарши чироқлар бўлса, уларни ёқиш","Габарит чироқларини ёқиш"],
            right: 0
        },
        {
            id: 17,
            img: null,
            question: "Йўлнинг қарама-қарши ҳаракат йўналиши томонига чиқиш қачон  таъқиқланади?",
            answer: ["Икки томонлама ҳаракатли, 4та ёки ундан кўп бўлакли йўлларда ", "Икки томонлама ҳаракатли, қарама-қарши йўналишдаги транспорт воситалари оқимлари иккита узлуксиз чизиқлар билан ажратилган, 4та бўлакли йўлларда", "Юқоридаги барча ҳолларда"],
            right: 2
        },
        {
            id: 18,
            img: null,
            question: "Қайси ҳолатда эгри йўлда ҳаракатланаётган автомобил турғунлиги таъминланган?",
            answer: ["Узатма уланган ҳолатда", "Узатма ажратилган ҳолатда", "Тезлик оширилганда"],
            right: 0
        },
        {
            id: 19,
            img: null,
            question: "Қайси шартларда транспорт воситаларидан фойдаланиш таъқиқланади?",
            answer: ["Гидравлик тормоз тизимидан суюқлик оқаётган бўлса", "Ишчи тормоз тизими самарадорлиги талабга жавоб бермайди", "Компрессор пневматик тормоз тизимида ўрнатилган босимни таъминлай олмаган ҳолатда","Кўрсатилган барча ҳолатларда"],
            right: 3
        },
    ],
    bilet1: [
        {
            id: 0,
            img: null,
            question: "Светафорнинг яшил милтилловчи ишораси нимани билдиради? ",
            answer: ["Светафор носозлигини", "Ҳаракатга рухсат беради ва тез орада тақиқловчи ишора ёниши тўғрисида ахборот беради", "Ҳаракатни давом эттиришни тақиқлайди",],
            right: 1,
        },
        {
            id: 1,
            img: img362,
            question: "Ушбу жойда автомобилни тўхтаб туриш учун қўйишга рухсат этиладими?",
            answer: ["Ҳа", "Нет"],
            right: 1,
        },
        {
            id: 2,
            img: img363,
            question: "Сиз чорраҳадан тўғрига ўтмоқчисиз. Ушбу вазиятда Сизнинг ҳаракатингиз?",
            answer: ["Чорраҳага биринчи кирган қизил автомобилга йўл бериш", "Қизил автомобиль йўл бераётганига ишонч хосил қилиб чорраҳадан биринчиўтиш",],
            right: 1

        },
        {
            id: 3,
            img: img364,
            question: "Сиз чорраҳадан чапга бурилмоқчисиз. Ушбу вазиятда кимга йўл берасиз?",
            answer: ["Фақат автобусга", "Фақат қизил автомобилга", "Ҳеч кимга",],
            right: 2
        },
        {
            id: 4,
            img: null,
            question: "Қайси ҳолларда йўлнинг ҳаракатланиш бўлагини ажратувчи узуқ-узуқ чизиқни босиб ўтиш мумкин?",
            answer: ["Фақат қайта тизилишда", "Йўлда бошқа транспорт воситалари бўлмаса", "Барча санаб ўтилган ҳолларда",],
            right: 0
        },
        {
            id: 5,
            img: img366,
            question: " Ушбу кўрсатилган ҳолатда мототцикл ҳайдовчиси сизга йўл бериши керакми?",
            answer: ["Йўқ", "Ҳа ",],
            right: 1
        }, {
            id: 6,
            question: "Санаб ўтилган қайси ҳолларда эгилувчан улагичда шатакка олиш тақиқланади?",
            answer: ["Фақат тоғли йўлларда", "Йўл яхмалак, сирпанчиқ бўлган ҳолларда", "Куннинг қоронғи вақтида ва етарли кўринмаслик шароитида", "Барча санаб ўтилган ҳолларда",],
            right: 1
        },
        {
            id: 7,
            img: img368,
            question: "Ушбу белгилардан қайси бири бир томонлама ҳаракат ташкил қилинган йўлнинг бошида ўpнaтилaди?",
            answer: ["Фақат «А» ", "Фақат «Б» ", "«Б» ва «Г» ", "«Б» ёки «В» ",],
            right: 1
        },
        {
            id: 8,
            img: img369,
            question: "Ушбу йўл нечта ҳаракатланиш бўлагига эга?",
            javob1: "",
            answer: ["Битта ҳаракатланиш бўлагига", "Иккита ҳаракатланиш бўлагига", "Учта ҳаракатланиш бўлагига"],
            right: 1
        },
        {
            id: 9,
            img: null,
            question: "Йўлда «ТЎХТАШ», ёзуви кўринишидаги йўл чизиғи нимани билдиради? ",
            answer: ["Тартибга солинган чорраҳада тўхташ чизиғига яқинлашаётганлиги хақида огоҳлантиради", "Тўхташ чизиғи ва «Тўхтамасдан ҳаракатланиш тақиқланади» йўл белгиси ўрнатилган йўл қисмига яқинлашаётганлигини билдиради", "«Йўл беринг» йўл белгисига яқинлашаётганлигини билдиради"],
            right: 1
        },
        {
            id: 10,
            img: img371,
            question: "Қайси ҳайдовчи тўхтаб туриш қоидасини бузди?",
            answer: ["Мототцикл ҳайдовчиси", "Тротуарда тўхтаб турган автомобиль ҳайдовчиси", "Ҳеч ким бузмади"],
            right: 1
        },
        {
            id: 11,
            img: null,
            question: "Typap жой даҳаларида қандай ҳаракатлар тақиқланган?",
            answer: ["Фақат ўқув машғулотларини бажариш", "Фақат двигатель ишлаб турганда тўхтаб туриш", "Барча санаб ўтилган ҳолларда"],
            right: 2
        },
        {
            id: 12,
            img: null,
            question: "Транспорт воситалари қаттиқ улагичда шатакка олинганда шатакка олган ва шатакка олинган транспорт воситалари орасидаги масофа қанча бўлиши керак?",
            answer: ["4 метрдан ошмаслиги", "4 метрдан 6 метргача", "Қоидаларда белгиланмаган"],
            right: 0
        },
        {
            id: 13,
            img: null,
            question: "Санаб ўтилган қайси ҳолатда транспорт воситасидан фойдаланишга рухсат этилади?",
            answer: ["Ташқи ёритгич асбоблари ифлосланган бўлса", "Ёритувчи чироқ нурининг йўналиши бузилган бўлса", "Олд қисмида - оқ ёки сариқ рангли туманга қарши фаралар ўрнатилган бўлса"],
            right: 2
        },
        {
            id: 14,
            img: null,
            question: "Йўлнинг сирпанчиқ қисмида руль чамбарагини кескин бурганда ҳосил бўладиган сирпанишнинг олдини олиш учун ҳайдовчи қандай эҳтиёт чораларини кўриши керак?",
            answer: ["Руль чамбарагини зудлик билан сирпанаётган томонга буриш ва тезда автомобилни ҳаракат йўналишини тўғирлаб олиш", "Илашмани узиш", "Тормоз тепкисини босиш"],
            right: 0
        },
        {
            id: 15,
            img: img376,
            question: "Кўрсатилган йўл белгиларидан қайси бири фақат йўл қопламаси нам бўлганда таъсир этади?",
            answer: ["Фақат «А»", "Фақат «А» ва «Б»", "Барчаси"],
            right: 0
        },
        {
            id: 16,
            img: img377,
            question: "Юк автомобили ҳайдовчиси тўхтаб туриш қоидасини буздими?",
            answer: ["Бузди", "Бузмади, aгap унинг рухсат этилган тўлиқ вазни 3,5 тоннадан ошмаса", "Хато қилмади"],
            right: 0
        },
        {
            id: 17,
            img: null,
            question: "Қандай ҳолларда аҳоли пунктларида товуш мосламаларидан фойдаланишга рухсат этилади?",
            answer: ["Қувиб ўтишда огоҳлантириш учун", "Йўл-транспорт ҳодисасининг олдини олиш учун", "Ҳар иккала санаб ўтилган ҳолларда"],
            right: 1
        },
        {
            id: 18,
            img: img379,
            question: "Кўрсатилган қайси белгилар сизга яшаш манзилингизга автомобилда ўтишга рухсат беради?",
            answer: ["Фақат «А»", "Фақат «Б»", "Фақат «А» ва «B»", "Барчаси"],
            right: 2
        },
        {
            id: 19,
            img: null,
            question: "Чорраҳага кирганингизда тартибга солувчи қўлини юқорига кўтарди, сизга ҳаракатланишга рухсат этиладими?",
            answer: ["Рухсат этилмайди", "Рухсат этилади, агарда сиз ўнгга буриладиган бўлсангиз", "Рухсат этилади"],
            right: 2
        },
    ],
} 