import { img362, img363, img364, img366, img368, img369, img371, img376, img377, img379 } from "../assets/images/png"

export const bilet = {
    bilet1: [
        {
            id: 0,
            img: null,
            question: "Светафорнинг яшил милтилловчи ишораси нимани билдиради? ",
            answer: ["Светафор носозлигини", "Ҳаракатга рухсат беради ва тез орада тақиқловчи ишора ёниши тўғрисида ахборот беради", "Ҳаракатни давом эттиришни тақиқлайди",],
            right: 1,
        },
        {
            id: 1,
            img: img362,
            question: "Ушбу жойда автомобилни тўхтаб туриш учун қўйишга рухсат этиладими?",
            answer: ["Ҳа", "Нет"],
            right: 1,
        },
        {
            id: 2,
            img: img363,
            question: "Сиз чорраҳадан тўғрига ўтмоқчисиз. Ушбу вазиятда Сизнинг ҳаракатингиз?",
            answer: ["Чорраҳага биринчи кирган қизил автомобилга йўл бериш", "Қизил автомобиль йўл бераётганига ишонч хосил қилиб чорраҳадан биринчиўтиш",],
            right: 1

        },
        {
            id: 3,
            img: img364,
            question: "Сиз чорраҳадан чапга бурилмоқчисиз. Ушбу вазиятда кимга йўл берасиз?",
            answer: ["Фақат автобусга", "Фақат қизил автомобилга", "Ҳеч кимга",],
            right: 2
        },
        {
            id: 4,
            img: null,
            question: "Қайси ҳолларда йўлнинг ҳаракатланиш бўлагини ажратувчи узуқ-узуқ чизиқни босиб ўтиш мумкин?",
            answer: ["Фақат қайта тизилишда", "Йўлда бошқа транспорт воситалари бўлмаса", "Барча санаб ўтилган ҳолларда",],
            right: 0
        },
        {
            id: 5,
            img: img366,
            question: " Ушбу кўрсатилган ҳолатда мототцикл ҳайдовчиси сизга йўл бериши керакми?",
            answer: ["Йўқ", "Ҳа ",],
            right: 1
        }, {
            id: 6,
            question: "Санаб ўтилган қайси ҳолларда эгилувчан улагичда шатакка олиш тақиқланади?",
            answer: ["Фақат тоғли йўлларда", "Йўл яхмалак, сирпанчиқ бўлган ҳолларда", "Куннинг қоронғи вақтида ва етарли кўринмаслик шароитида", "Барча санаб ўтилган ҳолларда",],
            right: 1
        },
        {
            id: 7,
            img: img368,
            question: "Ушбу белгилардан қайси бири бир томонлама ҳаракат ташкил қилинган йўлнинг бошида ўpнaтилaди?",
            answer: ["Фақат «А» ", "Фақат «Б» ", "«Б» ва «Г» ", "«Б» ёки «В» ",],
            right: 1
        },
        {
            id: 8,
            img: img369,
            question: "Ушбу йўл нечта ҳаракатланиш бўлагига эга?",
            javob1: "",
            answer: ["Битта ҳаракатланиш бўлагига", "Иккита ҳаракатланиш бўлагига", "Учта ҳаракатланиш бўлагига"],
            right: 1
        },
        {
            id: 9,
            img: null,
            question: "Йўлда «ТЎХТАШ», ёзуви кўринишидаги йўл чизиғи нимани билдиради? ",
            answer: ["Тартибга солинган чорраҳада тўхташ чизиғига яқинлашаётганлиги хақида огоҳлантиради", "Тўхташ чизиғи ва «Тўхтамасдан ҳаракатланиш тақиқланади» йўл белгиси ўрнатилган йўл қисмига яқинлашаётганлигини билдиради", "«Йўл беринг» йўл белгисига яқинлашаётганлигини билдиради"],
            right: 1
        },
        {
            id: 10,
            img: img371,
            question: "Қайси ҳайдовчи тўхтаб туриш қоидасини бузди?",
            answer: ["Мототцикл ҳайдовчиси", "Тротуарда тўхтаб турган автомобиль ҳайдовчиси", "Ҳеч ким бузмади"],
            right: 1
        },
        {
            id: 11,
            img: null,
            question: "Typap жой даҳаларида қандай ҳаракатлар тақиқланган?",
            answer: ["Фақат ўқув машғулотларини бажариш", "Фақат двигатель ишлаб турганда тўхтаб туриш", "Барча санаб ўтилган ҳолларда"],
            right: 2
        },
        {
            id: 12,
            img: null,
            question: "Транспорт воситалари қаттиқ улагичда шатакка олинганда шатакка олган ва шатакка олинган транспорт воситалари орасидаги масофа қанча бўлиши керак?",
            answer: ["4 метрдан ошмаслиги", "4 метрдан 6 метргача", "Қоидаларда белгиланмаган"],
            right: 0
        },
        {
            id: 13,
            img: null,
            question: "Санаб ўтилган қайси ҳолатда транспорт воситасидан фойдаланишга рухсат этилади?",
            answer: ["Ташқи ёритгич асбоблари ифлосланган бўлса", "Ёритувчи чироқ нурининг йўналиши бузилган бўлса", "Олд қисмида - оқ ёки сариқ рангли туманга қарши фаралар ўрнатилган бўлса"],
            right: 2
        },
        {
            id: 14,
            img: null,
            question: "Йўлнинг сирпанчиқ қисмида руль чамбарагини кескин бурганда ҳосил бўладиган сирпанишнинг олдини олиш учун ҳайдовчи қандай эҳтиёт чораларини кўриши керак?",
            answer: ["Руль чамбарагини зудлик билан сирпанаётган томонга буриш ва тезда автомобилни ҳаракат йўналишини тўғирлаб олиш", "Илашмани узиш", "Тормоз тепкисини босиш"],
            right: 0
        },
        {
            id: 15,
            img: img376,
            question: "Кўрсатилган йўл белгиларидан қайси бири фақат йўл қопламаси нам бўлганда таъсир этади?",
            answer: ["Фақат «А»", "Фақат «А» ва «Б»", "Барчаси"],
            right: 0
        },
        {
            id: 16,
            img: img377,
            question: "Юк автомобили ҳайдовчиси тўхтаб туриш қоидасини буздими?",
            answer: ["Бузди", "Бузмади, aгap унинг рухсат этилган тўлиқ вазни 3,5 тоннадан ошмаса", "Хато қилмади"],
            right: 0
        },
        {
            id: 17,
            img: null,
            question: "Қандай ҳолларда аҳоли пунктларида товуш мосламаларидан фойдаланишга рухсат этилади?",
            answer: ["Қувиб ўтишда огоҳлантириш учун", "Йўл-транспорт ҳодисасининг олдини олиш учун", "Ҳар иккала санаб ўтилган ҳолларда"],
            right: 1
        },
        {
            id: 18,
            img: img379,
            question: "Кўрсатилган қайси белгилар сизга яшаш манзилингизга автомобилда ўтишга рухсат беради?",
            answer: ["Фақат «А»", "Фақат «Б»", "Фақат «А» ва «B»", "Барчаси"],
            right: 2
        },
        {
            id: 19,
            img: null,
            question: "Чорраҳага кирганингизда тартибга солувчи қўлини юқорига кўтарди, сизга ҳаракатланишга рухсат этиладими?",
            answer: ["Рухсат этилмайди", "Рухсат этилади, агарда сиз ўнгга буриладиган бўлсангиз", "Рухсат этилади"],
            right: 2
        },
    ],
} 